Repository: angell98s/irobot
Catalog: lib/src/localization/app_*.arb
Languages: es

source: Abandonment
es: Desamparo

# actConDis
source: Active or constructive distraction
es: Distracción activa o constructiva

# actHapWri
source: Acting happy, writing / venting or venting / catharsis
es: Actuar feliz, escribir / ventilar o descargar / catarsis

source: Admiration
es: Admiración

source: Alarm sound
es: Sonido de la alarma

source: Astonishment
es: Asombro

source: Automatic alarm
es: Alarma automatica

source: Aversion
es: Aversión

source: Chip status
es: Estado del chip

source: Confusion
es: Confusión

source: Defeat
es: Derrota

source: Delusion
es: Ilusión

source: Devotion
es: Adoración

source: Discomfort
es: Incomodidad

source: Disgust
es: Asco

source: Ecstasy
es: Éxtasis

source: Euphoria
es: Euforia

# fingerprint
source: Recognising fingerprints
es: Reconociendo huella

source: heartbreak
es: Desamor

# identi_percep
source: identification/perception
es: identificación/percepción

source: Impatience
es: Impaciencia

source: Impotence
es: Impotencia

source: Joy
es: Alegria

source: Loneliness
es: Soledad

source: Love
es: Amor

source: Next
es: Siguiente

# posRea
source: Positive reappraisal
es: Reevaluación positiva

source: Rage
es: Ira

# ratCogDis
source: Rationalisation, cognitive distraction
es: Racionalización, distracción cognitiva

source: Rebellion
es: Rebeldía

# regula_modify
source: regulate/modify
es: regulación/modificación

# relPleDis
source: Relaxation, pleasurable distraction, resting
es: Relajación, distracción placentera, descanso

source: Repugnance
es: Desagrado

source: Repulsion
es: Repulsión

source: Resentment
es: Rencor

# rumNegApp
source: Rumination or negative appraisal
es: Rumiación o evaluación negativa

source: Sadness
es: Tristeza

source: scanning
es: escaneando

source: Scary
es: Miedo

# seeSocSup
source: Seeking social support
es: Búsqueda de apoyo social

# select_recogn
source: selection/recognise
es: Selección/Reconocimiento

source: Signal found
es: Señal encontrada

source: Strategies
es: Estrategias

source: Surprise
es: Sorpresa

source: Triumph
es: Triunfo

# unders_assimi
source: understand/assimilate
es: compresión/asimilación

source: Unsafety
es: Inseguridad

source: Video call request
es: Solicitud de video
